HomeWork-3/reports/withIndex/R1000-d5m/wrk.txt
Running 5m test @ http://localhost:5000
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.95s     1.31s   19.32s    83.92%
    Req/Sec    10.41      9.24    60.00     68.16%
  1700 requests in 5.00m, 1.27MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:      5.66
Transfer/sec:      4.32KB