HomeWork-3/reports/withIndex/R1000-d5m/wrk2.txt
Running 5m test @ http://localhost:5000
  2 threads and 100 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.47m     1.32m    4.72m    55.91%
    Req/Sec     3.04     18.42   333.00     97.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.49m 
 75.000%    3.60m 
 90.000%    4.36m 
 99.000%    4.70m 
 99.900%    4.72m 
 99.990%    4.73m 
 99.999%    4.73m 
100.000%    4.73m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10756.095     0.000000            1         1.00
   36306.943     0.100000          169         1.11
   68157.439     0.200000          339         1.25
   94765.055     0.300000          505         1.43
  118358.015     0.400000          674         1.67
  149291.007     0.500000          842         2.00
  164888.575     0.550000          928         2.22
  179830.783     0.600000         1010         2.50
  185991.167     0.650000         1094         2.86
  200540.159     0.700000         1179         3.33
  216006.655     0.750000         1263         4.00
  227147.775     0.775000         1305         4.44
  231473.151     0.800000         1349         5.00
  234618.879     0.825000         1391         5.71
  246808.575     0.850000         1432         6.67
  249298.943     0.875000         1476         8.00
  251920.383     0.887500         1494         8.89
  261488.639     0.900000         1515        10.00
  263716.863     0.912500         1537        11.43
  265289.727     0.925000         1557        13.33
  266600.447     0.937500         1578        16.00
  267911.167     0.943750         1589        17.78
  270270.463     0.950000         1599        20.00
  276299.775     0.956250         1610        22.86
  277872.639     0.962500         1621        26.67
  279183.359     0.968750         1631        32.00
  279707.647     0.971875         1637        35.56
  280231.935     0.975000         1641        40.00
  281018.367     0.978125         1651        45.71
  281280.511     0.981250         1654        53.33
  281804.799     0.984375         1660        64.00
  281804.799     0.985938         1660        71.11
  282066.943     0.987500         1668        80.00
  282066.943     0.989062         1668        91.43
  282066.943     0.990625         1668       106.67
  282329.087     0.992188         1671       128.00
  282591.231     0.992969         1674       142.22
  282591.231     0.993750         1674       160.00
  282591.231     0.994531         1674       182.86
  282853.375     0.995313         1679       213.33
  282853.375     0.996094         1679       256.00
  282853.375     0.996484         1679       284.44
  282853.375     0.996875         1679       320.00
  282853.375     0.997266         1679       365.71
  283115.519     0.997656         1681       426.67
  283115.519     0.998047         1681       512.00
  283115.519     0.998242         1681       568.89
  283115.519     0.998437         1681       640.00
  283115.519     0.998633         1681       731.43
  283377.663     0.998828         1682       853.33
  283377.663     0.999023         1682      1024.00
  283377.663     0.999121         1682      1137.78
  283377.663     0.999219         1682      1280.00
  283377.663     0.999316         1682      1462.86
  283639.807     0.999414         1683      1706.67
  283639.807     1.000000         1683          inf
#[Mean    =   148352.557, StdDeviation   =    79485.533]
#[Max     =   283377.664, Total count    =         1683]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   17.50s 
 75.000%   17.86s 
 90.000%   18.30s 
 99.000%   19.27s 
 99.900%   19.51s 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5517.311     0.000000            1         1.00
   16547.839     0.100000          169         1.11
   16941.055     0.200000          337         1.25
   17186.815     0.300000          513         1.43
   17383.423     0.400000          690         1.67
   17498.111     0.500000          848         2.00
   17563.647     0.550000          932         2.22
   17645.567     0.600000         1013         2.50
   17727.487     0.650000         1107         2.86
   17793.023     0.700000         1187         3.33
   17858.559     0.750000         1265         4.00
   17907.711     0.775000         1307         4.44
   17956.863     0.800000         1357         5.00
   18006.015     0.825000         1398         5.71
   18071.551     0.850000         1431         6.67
   18186.239     0.875000         1475         8.00
   18219.007     0.887500         1494         8.89
   18300.927     0.900000         1520        10.00
   18366.463     0.912500         1538        11.43
   18464.767     0.925000         1562        13.33
   18530.303     0.937500         1580        16.00
   18579.455     0.943750         1590        17.78
   18644.991     0.950000         1600        20.00
   18726.911     0.956250         1611        22.86
   18792.447     0.962500         1620        26.67
   18890.751     0.968750         1632        32.00
   18923.519     0.971875         1636        35.56
   18989.055     0.975000         1641        40.00
   19087.359     0.978125         1649        45.71
   19120.127     0.981250         1653        53.33
   19202.047     0.984375         1658        64.00
   19218.431     0.985938         1662        71.11
   19218.431     0.987500         1662        80.00
   19267.583     0.989062         1667        91.43
   19300.351     0.990625         1669       106.67
   19316.735     0.992188         1672       128.00
   19316.735     0.992969         1672       142.22
   19333.119     0.993750         1673       160.00
   19365.887     0.994531         1674       182.86
   19447.807     0.995313         1677       213.33
   19447.807     0.996094         1677       256.00
   19464.191     0.996484         1679       284.44
   19464.191     0.996875         1679       320.00
   19464.191     0.997266         1679       365.71
   19480.575     0.997656         1680       426.67
   19480.575     0.998047         1680       512.00
   19513.343     0.998242         1681       568.89
   19513.343     0.998437         1681       640.00
   19513.343     0.998633         1681       731.43
   19546.111     0.998828         1682       853.33
   19546.111     0.999023         1682      1024.00
   19546.111     0.999121         1682      1137.78
   19546.111     0.999219         1682      1280.00
   19546.111     0.999316         1682      1462.86
   60030.975     0.999414         1683      1706.67
   60030.975     1.000000         1683          inf
#[Mean    =    17451.602, StdDeviation   =     1385.542]
#[Max     =    59998.208, Total count    =         1683]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1684 requests in 5.01m, 1.28MB read
  Socket errors: connect 0, read 0, write 0, timeout 15
Requests/sec:      5.61
Transfer/sec:      4.36KB